haskell/grains/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-04 Fri 23:27 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Exercism.io → Haskell → Grains</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Eric Bailey">
<meta  name="description" content="My solutions to Excercism.io in Haskell."
>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/css/bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="../../css/style.min.css">


</head>
<body>
<div id="content">
<h1 class="title">Exercism.io → Haskell → Grains</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Grains</a>
<ul>
<li><a href="#orgheadline2">Source</a></li>
<li><a href="#orgheadline3">Solution</a>
<ul>
<li><a href="#orgheadline4">Recursive Alternatives</a></li>
</ul>
</li>
<li><a href="#orgheadline5">Tests</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Grains</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Write a program that calculates the number of grains of wheat on a chessboard given that the number on each square doubles.
</p>

<p>
There once was a wise servant who saved the life of a prince. The king
promised to pay whatever the servant could dream up. Knowing that the
king loved chess, the servant told the king he would like to have grains
of wheat. One grain on the first square of a chess board. Two grains on
the next. Four on the third, and so on.
</p>

<p>
There are 64 squares on a chessboard.
</p>

<p>
Write a program that shows:
</p>
<ul class="org-ul">
<li>how many grains were on each square, and</li>
<li>the total number of grains</li>
</ul>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Source</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
JavaRanch Cattle Drive, exercise 6 <a href="http://www.javaranch.com/grains.jsp">view source</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Solution</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">square</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">square</span> <span style="color: #FD971F;">=</span> (2 <span style="color: #FD971F;">^</span>) . subtract 1
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">total</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">total</span> <span style="color: #FD971F;">=</span> sum (map square [1<span style="color: #FD971F;">..</span>64])
</pre>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">Recursive Alternatives</h4>
<div class="outline-text-4" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">square</span>' <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">square</span>' 1 <span style="color: #FD971F;">=</span> 1
<span style="color: #A6E22E;">square</span>' x <span style="color: #FD971F;">=</span> 2 <span style="color: #FD971F;">*</span> square' (x - 1)

<span style="color: #A6E22E;">total</span>' <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">total</span>' <span style="color: #FD971F;">=</span> sum (map square' [1<span style="color: #FD971F;">..</span>64])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Tests</h3>
<div class="outline-text-3" id="text-orgheadline5">
<div class="org-src-container">

<pre class="src src-fish"><span style="color: #F92672;">runhaskell</span> grains_test.hs
</pre>
</div>
<pre class="example">
Cases: 5  Tried: 5  Errors: 0  Failures: 0
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
